Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData.CurrentPhaseC
The value of current on electrical phase C.
Since:
2025

Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData.CurrentPhaseB
The value of current on electrical phase B.
Since:
2025

Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData.CurrentPhaseA
The value of current on electrical phase A.
Since:
2025

Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData
This class represents per phase values including current and load.
Since:
2025